cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>ADSEL2</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRMODE2</name>
              <description>Set the Precision Mode For Slot.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P14B</name>
                  <description>14-bit precision mode value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12B</name>
                  <description>12-bit precision mode value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10B</name>
                  <description>10-bit precision mode value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8B</name>
                  <description>8-bit precision mode value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>Select one of the 14 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>single ended external GPIO connection to pad16. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE1</name>
                  <description>single ended external GPIO connection to pad29. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE2</name>
                  <description>single ended external GPIO connection to pad11. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE3</name>
                  <description>single ended external GPIO connection to pad31. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE4</name>
                  <description>single ended external GPIO connection to pad32. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE5</name>
                  <description>single ended external GPIO connection to pad33. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE6</name>
                  <description>single ended external GPIO connection to pad34. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE7</name>
                  <description>single ended external GPIO connection to pad35. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE8</name>
                  <description>single ended external GPIO connection to pad13. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE9</name>
                  <description>single ended external GPIO connection to pad12. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF0</name>
                  <description>differential external GPIO connections to pad12(N) and pad13(P). value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF1</name>
                  <description>differential external GPIO connections to pad15(N) and pad14(P). value.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>internal temperature sensor. value.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATT</name>
                  <description>internal voltage divide-by-3 connection. value.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Input VSS value.</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN2</name>
              <description>This bit enables the window compare function for slot 2.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 2. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN2</name>
              <description>This bit enables slot 2 for ADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 2 for ADC conversions. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SL3CFG</name>
          <description>Slot 3 Configuration Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07030F03</resetMask>

          <fields>
            <field>
              <name>ADSEL3</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRMODE3</name>
              <description>Set the Precision Mode For Slot.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P14B</name>
                  <description>14-bit precision mode value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12B</name>
                  <description>12-bit precision mode value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10B</name>
                  <description>10-bit precision mode value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8B</name>
                  <description>8-bit precision mode value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>Select one of the 14 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>single ended external GPIO connection to pad16. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE1</name>
                  <description>single ended external GPIO connection to pad29. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE2</name>
                  <description>single ended external GPIO connection to pad11. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE3</name>
                  <description>single ended external GPIO connection to pad31. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE4</name>
                  <description>single ended external GPIO connection to pad32. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE5</name>
                  <description>single ended external GPIO connection to pad33. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE6</name>
                  <description>single ended external GPIO connection to pad34. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE7</name>
                  <description>single ended external GPIO connection to pad35. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE8</name>
                  <description>single ended external GPIO connection to pad13. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE9</name>
                  <description>single ended external GPIO connection to pad12. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF0</name>
                  <description>differential external GPIO connections to pad12(N) and pad13(P). value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF1</name>
                  <description>differential external GPIO connections to pad15(N) and pad14(P). value.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>internal temperature sensor. value.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATT</name>
                  <description>internal voltage divide-by-3 connection. value.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Input VSS value.</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN3</name>
              <description>This bit enables the window compare function for slot 3.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 3. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN3</name>
              <description>This bit enables slot 3 for ADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 3 for ADC conversions. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SL4CFG</name>
          <description>Slot 4 Configuration Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07030F03</resetMask>

