cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>CACHECTRL</name>
      <version>1.0</version>
      <description>Flash Cache Controller</description>
      <!-- <groupName>GROUP_CACHECTRL</groupName> -->
      <baseAddress>0x40018000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000240</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CACHECFG</name>
          <description>Flash Cache Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00166C50</resetValue>
          <resetMask>0x011FFFFF</resetMask>

          <fields>
            <field>
              <name>ENABLE_MONITOR</name>
              <description>Enable Cache Monitoring Stats</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA_CLKGATE</name>
              <description>Enable clock gating of entire data array</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SMDLY</name>
              <description>Data RAM delay</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DLY</name>
              <description>Data RAM delay</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_LS</name>
              <description>Enable LS (light sleep) of cache RAMs.  When this bit is set, the cache's RAMS will be put into light sleep mode while inactive.  NOTE:  if the cache is actively used, this may have an adverse affect on power since entering/exiting LS mode may consume more power than would be saved.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_CLKGATE</name>
              <description>Enable clock gating of cache RAMs</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCACHE_ENABLE</name>
              <description>Enable Flash Instruction Caching</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ICACHE_ENABLE</name>
              <description>Enable Flash Instruction Caching</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SERIAL</name>
              <description>Bitfield should always be programmed to 0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONFIG</name>
              <description>Sets the cache configuration</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W2_128B_512E</name>
                  <description>Two-way set associative, 128-bit linesize, 512 entries (8 SRAMs active) value.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_NC1</name>
              <description>Enable Non-cacheable region 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLE_NC0</name>
              <description>Enable Non-cacheable region 0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LRU</name>
              <description>Sets the cache replacement policy.  0=LRR (least recently replaced), 1=LRU (least recently used).  LRR minimizes writes to the TAG SRAM.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLE</name>
              <description>Enables the flash cache controller.  I/D caching enabled independently.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCFG</name>
          <description>Flash Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>RD_WAIT</name>
              <description>Sets read waitstates (HCLK cycles)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CACHECTRL</name>
          <description>Cache Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000777</resetMask>

          <fields>
            <field>
              <name>FLASH1_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

