cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>FLASH1_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_STATUS</name>
              <description>Flash Sleep Mode Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_STATUS</name>
              <description>Flash Sleep Mode Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_READY</name>
              <description>Cache Ready Status (enabled and not processing an invalidate operation)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESET_STAT</name>
              <description>Writing a 1 to this bitfield will reset the cache monitor statistics (DMON0-3, IMON0-3).  Statistic gathering can be paused/stopped by disabling the MONITOR_ENABLE bit in CACHECFG, which will maintain the count values until the stats are reset by writing this bitfield.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Cache Stats value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVALIDATE</name>
              <description>Writing a 1 to this bitfield invalidates the flash cache contents.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GO</name>
                  <description>Initiate a programming operation to flash info. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NCR0START</name>
          <description>Flash Cache Noncachable Region 0 Start Address.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 0.  The physical address of the start of this region should be programmed to this register and must be aligned to a 16-byte boundary (thus the lower 4 address bits are unused).</description>
              <bitRange>[19:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR0END</name>
          <description>Flash Cache Noncachable Region 0 End</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 0.  The physical address of the end of this region should be programmed to this register and must be aligned to a 16-byte boundary (thus the lower 4 address bits are unused).</description>
              <bitRange>[19:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1START</name>
          <description>Flash Cache Noncachable Region 1 Start</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 1.  The physical address of the start of this region should be programmed to this register and must be aligned to a 16-byte boundary (thus the lower 4 address bits are unused).</description>
              <bitRange>[19:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1END</name>
          <description>Flash Cache Noncachable Region 1 End</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 1.  The physical address of the end of this region should be programmed to this register and must be aligned to a 16-byte boundary (thus the lower 4 address bits are unused).</description>
              <bitRange>[19:4]</bitRange>
              <access>read-write</access>

