cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>CTMRA0C1INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR1.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C0INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C0INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C0INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C0INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C0INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR0.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C0INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C0INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C0INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Counter/Timer Interrupts: Set</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTMRB3C1INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR1.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C1INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR1.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C1INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR1.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C1INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR1.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C1INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR1.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C1INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR1.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C1INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR1.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C1INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR1.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C0INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C0INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C0INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C0INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C0INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR0.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

