cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>GPIO</name>
      <version>1.0</version>
      <description>General Purpose IO</description>
      <!-- <groupName>GROUP_GPIO</groupName> -->
      <baseAddress>0x40010000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO</name>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>PADREGA</name>
          <description>Pad Configuration Register A</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3F3FFFFF</resetMask>

          <fields>
            <field>
              <name>PAD3FNCSEL</name>
              <description>Pad 3 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS output value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLnCE</name>
                  <description>Configure as the IOSLAVE SPI nCE signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR1 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO3</name>
                  <description>Configure as GPIO3 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxnCELB</name>
                  <description>Configure as the IOSLAVE SPI nCE loopback signal from IOMSTRx value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR2 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1</name>
                  <description>Configure as the ADC Trigger 1 signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_WCLK</name>
                  <description>Configure as the PDM I2S Word Clock input value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3STRNG</name>
              <description>Pad 3 drive strength.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3INPEN</name>
              <description>Pad 3 input enable.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3PULL</name>
              <description>Pad 3 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2FNCSEL</name>
              <description>Pad 2 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLWIR3</name>
                  <description>Configure as the IOSLAVE SPI 3-wire MOSI/MISO signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMOSI</name>
                  <description>Configure as the IOSLAVE SPI MOSI signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as the UART0 RX input value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO2</name>
                  <description>Configure as GPIO2 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxMOSILB</name>
                  <description>Configure as the IOSLAVE SPI MOSI loopback signal from IOMSTRx value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2MOSI</name>
                  <description>Configure as the IOMSTR2 SPI MOSI output signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxWIR3LB</name>
                  <description>Configure as the IOSLAVE SPI 3-wire MOSI/MISO loopback signal from IOMSTRx value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2WIR3</name>
                  <description>Configure as the IOMSTR2 SPI 3-wire MOSI/MISO signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2STRNG</name>
              <description>Pad 2 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2INPEN</name>
              <description>Pad 2 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD2PULL</name>
              <description>Pad 2 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1RSEL</name>
              <description>Pad 1 pullup resistor selection.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1FNCSEL</name>
              <description>Pad 1 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLSDA</name>
                  <description>Configure as the IOSLAVE I2C SDA signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMISO</name>
                  <description>Configure as the IOSLAVE SPI MISO signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as the UART0 TX output signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO1</name>
                  <description>Configure as GPIO1 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxMISOLB</name>
                  <description>Configure as the IOSLAVE SPI MISO loopback signal from IOMSTRx value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2MISO</name>
                  <description>Configure as the IOMSTR2 SPI MISO input signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxSDALB</name>
                  <description>Configure as the IOSLAVE I2C SDA loopback signal from IOMSTRx value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SDA</name>
                  <description>Configure as the IOMSTR2 I2C Serial data I/O signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1STRNG</name>
              <description>Pad 1 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1INPEN</name>
              <description>Pad 1 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD1PULL</name>
              <description>Pad 1 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0RSEL</name>
              <description>Pad 0 pullup resistor selection.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0FNCSEL</name>
              <description>Pad 0 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLSCL</name>
                  <description>Configure as the IOSLAVE I2C SCL signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSCK</name>
                  <description>Configure as the IOSLAVE SPI SCK signal value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as the CLKOUT signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO0</name>
                  <description>Configure as GPIO0 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxSCKLB</name>
                  <description>Configure as the IOSLAVE SPI SCK loopback signal from IOMSTRx value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCK</name>
                  <description>Configure as the IOMSTR2 SPI SCK output value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MxSCLLB</name>
                  <description>Configure as the IOSLAVE I2C SCL loopback signal from IOMSTRx value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCL</name>
                  <description>Configure as the IOMSTR2 I2C SCL clock I/O signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0STRNG</name>
              <description>Pad 0 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0INPEN</name>
              <description>Pad 0 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD0PULL</name>
              <description>Pad 0 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGB</name>
          <description>Pad Configuration Register B</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3FFFFFBF</resetMask>

