cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>PAD15FNCSEL</name>
              <description>Pad 15 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD1N</name>
                  <description>Configure as the analog ADC differential pair 1 N input signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO15</name>
                  <description>Configure as GPIO15 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE2</name>
                  <description>Configure as the SPI Channel 2 nCE signal from IOMSTR2 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXT</name>
                  <description>Configure as the external XTAL oscillator input value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDIO</name>
                  <description>Configure as an alternate port for the SWDIO I/O signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as an SWO (Serial Wire Trace output) value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15STRNG</name>
              <description>Pad 15 drive strentgh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15INPEN</name>
              <description>Pad 15 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15PULL</name>
              <description>Pad 15 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14FNCSEL</name>
              <description>Pad 14 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD1P</name>
                  <description>Configure as the analog ADC differential pair 1 P input signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE2</name>
                  <description>Configure as the SPI channel 2 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX output signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO14</name>
                  <description>Configure as GPIO14 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR2 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHFS</name>
                  <description>Configure as the External HFRC oscillator input select value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDCK</name>
                  <description>Configure as the alternate input for the SWDCK input signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32khz_XT</name>
                  <description>Configure as the 32kHz crystal output signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14STRNG</name>
              <description>Pad 14 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14INPEN</name>
              <description>Pad 14 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14PULL</name>
              <description>Pad 14 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13FNCSEL</name>
              <description>Pad 13 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD0PSE8</name>
                  <description>Configure as the ADC Differential pair 0 P, or Single Ended input 8 analog input signal. Determination of the D0P vs SE8 usage is done when the particular channel is selected within the ADC module value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB0</name>
                  <description>Configure as the input/output signal from CTIMER B0 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO13</name>
                  <description>Configure as GPIO13 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR2 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHFB</name>
                  <description>Configure as the external HFRC oscillator input value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS signal output value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX input signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13STRNG</name>
              <description>Pad 13 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13INPEN</name>
              <description>Pad 13 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13PULL</name>
              <description>Pad 13 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12FNCSEL</name>
              <description>Pad 12 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD0NSE9</name>
                  <description>Configure as the ADC Differential pair 0 N, or Single Ended input 9 analog input signal. Determination of the D0N vs SE9 usage is done when the particular channel is selected within the ADC module value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA0</name>
                  <description>Configure as the input/output signal from CTIMER A0 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO12</name>
                  <description>Configure as GPIO12 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as CLKOUT signal value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM_CLK</name>
                  <description>Configure as the PDM CLK output signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0CTS</name>
                  <description>Configure as the UART0 CTS input signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX output signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12STRNG</name>
              <description>Pad 12 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12INPEN</name>
              <description>Pad 12 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12PULL</name>
              <description>Pad 12 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGE</name>
          <description>Pad Configuration Register E</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>

