cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>PAD27RSEL</name>
              <description>Pad 27 pullup resistor selection.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD27FNCSEL</name>
              <description>Pad 27 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTHF</name>
                  <description>Configure as the external HFRC oscillator input value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO27</name>
                  <description>Configure as GPIO27 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCL</name>
                  <description>Configure as I2C clock I/O signal from IOMSTR2 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCK</name>
                  <description>Configure as SPI clock output signal from IOMSTR2 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCKLB</name>
                  <description>Configure as IOMSTR2 SPI SCK loopback signal from IOSLAVE value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCLLB</name>
                  <description>Configure as IOMSTR2 I2C SCL loopback signal from IOSLAVE value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD27STRNG</name>
              <description>Pad 27 drive strentgh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD27INPEN</name>
              <description>Pad 27 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD27PULL</name>
              <description>Pad 27 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD26FNCSEL</name>
              <description>Pad 26 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTLF</name>
                  <description>Configure as the external LFRC oscillator input value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB0</name>
                  <description>Configure as the input/output signal from CTIMER B0 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO26</name>
                  <description>Configure as GPIO26 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR2 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR5 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR3 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD26STRNG</name>
              <description>Pad 26 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD26INPEN</name>
              <description>Pad 26 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD26PULL</name>
              <description>Pad 26 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25RSEL</name>
              <description>Pad 25 pullup resistor selection.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25FNCSEL</name>
              <description>Pad 25 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTXT</name>
                  <description>Configure as the external XTAL oscillator input value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE2</name>
                  <description>Configure as the SPI channel 2 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA0</name>
                  <description>Configure as the input/output signal from CTIMER A0 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO25</name>
                  <description>Configure as GPIO25 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SDA</name>
                  <description>Configure as the IOMSTR2 I2C Serial data I/O signal value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2MISO</name>
                  <description>Configure as the IOMSTR2 SPI MISO input signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLMISOLB</name>
                  <description>Configure as the IOMSTR0 SPI MISO loopback signal from IOSLAVE value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLSDALB</name>
                  <description>Configure as the IOMSTR0 I2C SDA loopback signal from IOSLAVE value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25STRNG</name>
              <description>Pad 25 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25INPEN</name>
              <description>Pad 25 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25PULL</name>
              <description>Pad 25 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD24FNCSEL</name>
              <description>Pad 24 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR2 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Configure as the CLKOUT signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO24</name>
                  <description>Configure as GPIO24 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR5 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_BCLK</name>
                  <description>Configure as the PDM I2S Byte clock input signal value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial trace data output signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD24STRNG</name>
              <description>Pad 24 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD24INPEN</name>
              <description>Pad 24 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD24PULL</name>
              <description>Pad 24 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGH</name>
          <description>Pad Configuration Register H</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>

