cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>PAD35FNCSEL</name>
              <description>Pad 35 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE7</name>
                  <description>Configure as the analog input for ADC single ended input 7 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO35</name>
                  <description>Configure as GPIO35 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4nCE6</name>
                  <description>Configure as the SPI channel 6 nCE signal from IOMSTR4 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS output value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3nCE2</name>
                  <description>Configure as the SPI channel 2 nCE signal from IOMSTR3 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35STRNG</name>
              <description>Pad 35 drive strentgh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35INPEN</name>
              <description>Pad 35 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35PULL</name>
              <description>Pad 35 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34FNCSEL</name>
              <description>Pad 34 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE6</name>
                  <description>Configure as the analog input for ADC single ended input 6 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE7</name>
                  <description>Configure as the SPI channel 7 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR2 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO34</name>
                  <description>Configure as GPIO34 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPRF2</name>
                  <description>Configure as the analog comparator reference 2 signal value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3nCE1</name>
                  <description>Configure as the SPI channel 1 nCE signal from IOMSTR3 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4nCE0</name>
                  <description>Configure as the SPI channel 0 nCE signal from IOMSTR4 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE2</name>
                  <description>Configure as the SPI channel 2 nCE signal from IOMSTR5 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34STRNG</name>
              <description>Pad 34 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34INPEN</name>
              <description>Pad 34 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD34PULL</name>
              <description>Pad 34 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33FNCSEL</name>
              <description>Pad 33 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE5</name>
                  <description>Configure as the analog ADC single ended port 5 input signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE6</name>
                  <description>Configure as the SPI channel 6 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32khz_XT</name>
                  <description>Configure as the 32kHz crystal output signal value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO33</name>
                  <description>Configure as GPIO33 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEF4</name>
                  <description>Undefined/should not be used value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3nCE7</name>
                  <description>Configure as the SPI channel 7 nCE signal from IOMSTR3 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB1</name>
                  <description>Configure as the input/output signal from CTIMER B1 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial trace data output signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33STRNG</name>
              <description>Pad 33 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33INPEN</name>
              <description>Pad 33 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD33PULL</name>
              <description>Pad 33 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32FNCSEL</name>
              <description>Pad 32 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE4</name>
                  <description>Configure as the analog input for ADC single ended input 4 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB3</name>
                  <description>Configure as the input/output signal from CTIMER B3 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO32</name>
                  <description>Configure as GPIO32 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEF4</name>
                  <description>Undefined/should not be used value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB1</name>
                  <description>Configure as the input/output signal from CTIMER B1 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEF6</name>
                  <description>Undefined/should not be used value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEF7</name>
                  <description>Undefined/should not be used value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32STRNG</name>
              <description>Pad 32 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32INPEN</name>
              <description>Pad 32 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD32PULL</name>
              <description>Pad 32 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGJ</name>
          <description>Pad Configuration Register J</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0xFF3F3F3F</resetMask>

