cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>PAD47FNCSEL</name>
              <description>Pad 47 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR2 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB2</name>
                  <description>Configure as the input/output signal from CTIMER B2 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO47</name>
                  <description>Configure as GPIO47 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5WIR3</name>
                  <description>Configure as the IOMSTR5 SPI 3-wire MOSI/MISO signal value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5MOSI</name>
                  <description>Configure as the IOMSTR5 SPI MOSI output signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR4 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLWIR3LB</name>
                  <description>Configure as the IOMSTR5 SPI 3-wire MOSI/MISO loopback signal from IOSLAVE value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47STRNG</name>
              <description>Pad 47 drive strentgh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47INPEN</name>
              <description>Pad 47 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47PULL</name>
              <description>Pad 47 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46FNCSEL</name>
              <description>Pad 46 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32khz_XT</name>
                  <description>Configure as the 32kHz output clock from the crystal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA2</name>
                  <description>Configure as the input/output signal from CTIMER A2 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO46</name>
                  <description>Configure as GPIO46 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR5 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4nCE4</name>
                  <description>Configure as the SPI channel 4 nCE signal from IOMSTR4 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial wire debug SWO signal value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46STRNG</name>
              <description>Pad 46 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46INPEN</name>
              <description>Pad 46 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46PULL</name>
              <description>Pad 46 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45FNCSEL</name>
              <description>Pad 45 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UA1CTS</name>
                  <description>Configure as the UART1 CTS input signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTB1</name>
                  <description>Configure as the input/output signal from CTIMER B1 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO45</name>
                  <description>Configure as GPIO45 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4nCE3</name>
                  <description>Configure as the SPI channel 3 nCE signal from IOMSTR4 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3nCE6</name>
                  <description>Configure as the SPI channel 6 nCE signal from IOMSTR3 value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE5</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR5 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45STRNG</name>
              <description>Pad 45 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45INPEN</name>
              <description>Pad 45 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45PULL</name>
              <description>Pad 45 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44FNCSEL</name>
              <description>Pad 44 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UA1RTS</name>
                  <description>Configure as the UART1 RTS output signal value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0nCE2</name>
                  <description>Configure as the SPI channel 2 nCE signal from IOMSTR0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCTA1</name>
                  <description>Configure as the input/output signal from CTIMER A1 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO44</name>
                  <description>Configure as GPIO44 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4WIR3</name>
                  <description>Configure as the IOMSTR4 SPI 3-wire MOSI/MISO signal value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4MOSI</name>
                  <description>Configure as the IOMSTR4 SPI MOSI signal value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5nCE6</name>
                  <description>Configure as the SPI channel 6 nCE signal from IOMSTR5 value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLWIR3LB</name>
                  <description>Configure as the IOMSTR4 SPI 3-wire MOSI/MISO loopback signal from IOSLAVE value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44STRNG</name>
              <description>Pad 44 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44INPEN</name>
              <description>Pad 44 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44PULL</name>
              <description>Pad 44 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGM</name>
          <description>Pad Configuration Register M</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001818</resetValue>
          <resetMask>0x0000FFFF</resetMask>

