cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ENSB</name>
          <description>GPIO Enable Register B Set</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>ENSB</name>
              <description>Set the GPIO49-32 output enables</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENCA</name>
          <description>GPIO Enable Register A Clear</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENCA</name>
              <description>Clear the GPIO31-0 output enables</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENCB</name>
          <description>GPIO Enable Register B Clear</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>ENCB</name>
              <description>Clear the GPIO49-32 output enables</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STMRCAP</name>
          <description>STIMER Capture Control</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F3F3F3F</resetValue>
          <resetMask>0x7F7F7F7F</resetMask>

          <fields>
            <field>
              <name>STPOL3</name>
              <description>STIMER Capture 3 Polarity.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL3</name>
              <description>STIMER Capture 3 Select.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STPOL2</name>
              <description>STIMER Capture 2 Polarity.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL2</name>
              <description>STIMER Capture 2 Select.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STPOL1</name>
              <description>STIMER Capture 1 Polarity.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL1</name>
              <description>STIMER Capture 1 Select.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STPOL0</name>
              <description>STIMER Capture 0 Polarity.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL0</name>
              <description>STIMER Capture 0 Select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

