cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOM0IRQ</name>
          <description>IOM0 Flow Control IRQ Select</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM0IRQ</name>
              <description>IOMSTR0 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM1IRQ</name>
          <description>IOM1 Flow Control IRQ Select</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM1IRQ</name>
              <description>IOMSTR1 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM2IRQ</name>
          <description>IOM2 Flow Control IRQ Select</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM2IRQ</name>
              <description>IOMSTR2 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM3IRQ</name>
          <description>IOM3 Flow Control IRQ Select</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM3IRQ</name>
              <description>IOMSTR3 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM4IRQ</name>
          <description>IOM4 Flow Control IRQ Select</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM4IRQ</name>
              <description>IOMSTR4 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM5IRQ</name>
          <description>IOM5 Flow Control IRQ Select</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM5IRQ</name>
              <description>IOMSTR5 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LOOPBACK</name>
          <description>IOM to IOS Loopback Control</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>LOOPBACK</name>
              <description>IOM to IOS loopback control.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOP0</name>
                  <description>Loop IOM0 to IOS value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP1</name>
                  <description>Loop IOM1 to IOS value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP2</name>
                  <description>Loop IOM2 to IOS value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP3</name>
                  <description>Loop IOM3 to IOS value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP4</name>
                  <description>Loop IOM4 to IOS value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP5</name>
                  <description>Loop IOM5 to IOS value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPNONE</name>
                  <description>No loopback connections value.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOOBS</name>
          <description>GPIO Observation Mode Sample register</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OBS_DATA</name>
              <description>Sample of the data output on the GPIO observation port.  May have async sampling issues, as the data is not synronized to the read operation.  Intended for debug purposes only</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

