cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>ICMD</name>
              <description>This is the illegal command interrupt. Software attempted to issue a CMD while another CMD was already in progress. Or an attempt was made to issue a non-zero-length write CMD with an empty FIFO.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IACC</name>
              <description>This is the illegal FIFO access interrupt. An attempt was made to read the FIFO during a write CMD. Or an attempt was made to write the FIFO on a read CMD.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLEN</name>
              <description>This is the WTLEN interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NAK</name>
              <description>This is the I2C NAK interrupt. The expected ACK from the slave was not received by the IOM.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>This is the Write FIFO Overflow interrupt. An attempt was made to write the FIFO while it was full (i.e. while FIFOSIZ > 124).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>This is the Read FIFO Underflow interrupt. An attempt was made to read FIFO when empty (i.e. while FIFOSIZ less than 4).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO Threshold interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDCMP</name>
              <description>This is the Command Complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="IOMSTR0">
      <name>IOMSTR1</name>
      <baseAddress>0x50005000</baseAddress>
      <interrupt>
        <name>IOMSTR1</name>
        <value>7</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOMSTR0">
      <name>IOMSTR2</name>
      <baseAddress>0x50006000</baseAddress>
      <interrupt>
        <name>IOMSTR2</name>
        <value>8</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOMSTR0">
      <name>IOMSTR3</name>
      <baseAddress>0x50007000</baseAddress>
      <interrupt>
        <name>IOMSTR3</name>
        <value>9</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOMSTR0">
      <name>IOMSTR4</name>
      <baseAddress>0x50008000</baseAddress>
      <interrupt>
        <name>IOMSTR4</name>
        <value>10</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="IOMSTR0">
      <name>IOMSTR5</name>
      <baseAddress>0x50009000</baseAddress>
      <interrupt>
        <name>IOMSTR5</name>
        <value>11</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>IOSLAVE</name>
      <version>1.0</version>
      <description>I2C/SPI Slave</description>
      <!-- <groupName>GROUP_IOSLAVE</groupName> -->
      <baseAddress>0x50000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOSLAVE</name>
        <value>4</value>
      </interrupt>      <interrupt>
        <name>IOSLAVEACC</name>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFOPTR</name>
          <description>Current FIFO Pointer</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>FIFOSIZ</name>
              <description>The number of bytes currently in the hardware FIFO.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOPTR</name>
              <description>Current FIFO pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCFG</name>
          <description>FIFO Configuration</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0x3F003F1F</resetMask>

          <fields>
            <field>
              <name>ROBASE</name>
              <description>Defines the read-only area.  The IO Slave read-only area is situated in LRAM at (ROBASE*8) to (FIFOOBASE*8-1)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOMAX</name>
              <description>These bits hold the maximum FIFO address in 8 byte segments.  It is also the beginning of the RAM area of the LRAM.  Note that no RAM area is configured if FIFOMAX is set to 0x1F.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

