cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>GENAD</name>
              <description>I2C General Address interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRDERR</name>
              <description>FIFO Read Error interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>FIFO Underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>FIFO Overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSIZE</name>
              <description>FIFO Size interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTEN</name>
          <description>Register Access Interrupts: Enable</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSTAT</name>
          <description>Register Access Interrupts: Status</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTCLR</name>
          <description>Register Access Interrupts: Clear</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSET</name>
          <description>Register Access Interrupts: Set</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MCUCTRL</name>
      <version>1.0</version>
      <description>MCU Miscellaneous Control Logic</description>
      <!-- <groupName>GROUP_MCUCTRL</groupName> -->
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0000034C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BROWNOUT</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CHIP_INFO</name>
          <description>Chip Information Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PARTNUM</name>
              <description>BCD part number.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO2</name>
                  <description>Apollo2 part number is 0x03XXXXXX. value.</description>
                  <value>50331648</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo part number is 0x01XXXXXX. value.</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PN_M</name>
                  <description>Mask for the PN field. value.</description>
                  <value>4278190080</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID0</name>
          <description>Unique Chip ID 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Unique chip ID 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO2</name>
                  <description>Apollo2 CHIPID0 (see datasheet for details). value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Unique Chip ID 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Unique chip ID 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO2</name>
                  <description>Apollo2 CHIPID1 (see datasheet for details). value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Chip Revision</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000011</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVMAJ</name>
              <description>Major Revision ID.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B</name>
                  <description>Apollo2 revision B value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Apollo2 revision A value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor Revision ID.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV0</name>
                  <description>Apollo2 minor revision value. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VENDORID</name>
          <description>Unique Vendor ID</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Unique Vendor ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMBIQ</name>
                  <description>Ambiq Vendor ID value.</description>
                  <value>1095582289</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGGER</name>
          <description>Debugger Access Control</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LOCKOUT</name>
              <description>Lockout of debugger (SWD).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

