cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BUCK</name>
          <description>Analog Buck Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>MEMBUCKRST</name>
              <description>Reset control override for Mem Buck; 0=enabled, 1=reset; Value is propagated only when the BUCKSWE bit is active, otherwise contrl is from the power control module.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKRST</name>
              <description>Reset control override for Core Buck; 0=enabled, 1=reset; Value is propagated only when the BUCKSWE bit is active, otherwise control is from the power control module.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BYPBUCKMEM</name>
              <description>Not used.  Additional control of buck is available in the power control module</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBUCKPWD</name>
              <description>Memory buck power down override. 1=Powered Down; 0=Enabled; Value is propagated only when the BUCKSWE bit is active, otherwise control is from the power control module.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Memory Buck Enable. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPBUCKANA</name>
              <description>HFRC clkgen bit 0 override. When set, this will override to 0 bit 0 of the hfrc_freq_clkgen internal bus (see internal Shelby-1473)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKPWD</name>
              <description>Core buck power down override. 1=Powered Down; 0=Enabled; Value is propagated only when the BUCKSWE bit is active, otherwise control is from the power control module.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Core Buck enable. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPBUCKCORE</name>
              <description>Not used.  Additional control of buck is available in the power control module</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BUCKSWE</name>
              <description>Buck Register Software Override Enable.  This will enable the override values for MEMBUCKPWD, COREBUCKPWD, COREBUCKRST, MEMBUCKRST, all to be propagated to the control logic, instead of the normal power control module signal.  Note - Must take care to have correct value for ALL the register bits when this SWE is enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>BUCK Software Override Disable. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>BUCK Software Override Enable. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUCK2</name>
          <description>Buck Control Reg2</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>BUCKLFCLKSEL</name>
              <description>Buck clkgen divider trim. 00 = 1.5MHz; 01 = 750kHz; 10 = 375kHz; 11 = 187.5kHz</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HYSTBUCKCORE</name>
              <description>Enable/disable hysteresis on core buck converters internal comparators.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable hysteresis on core buck converters internal comparators. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable hysteresis on core buck converters internal comparators. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTBUCKMEM</name>
              <description>Enable/disable hysteresis on memory buck converters internal comparators.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable hysteresis on memory buck converters internal comparators. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable hysteresis on memory buck converters internal comparators. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMEMTONSEL</name>
              <description>Flash Buck high turn on trim</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

