cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>BCORETONSEL</name>
              <description>Core Buck low turn on trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BUCK3</name>
          <description>Buck control reg 3</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>

          <fields>
            <field>
              <name>MEMBUCKLOTON</name>
              <description>MEM Buck low TON trim value</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBUCKBURSTEN</name>
              <description>MEM Buck burst enable 0=disable, 0=disabled, 1=enable.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBUCKZXTRIM</name>
              <description>Memory buck zero crossing trim value</description>
              <bitRange>[16:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBUCKHYSTTRIM</name>
              <description>Hysterisis trim for mem buck</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKLOTON</name>
              <description>Core Buck low TON trim value</description>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKBURSTEN</name>
              <description>Core Buck burst enable. 0=disabled, 1=enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKZXTRIM</name>
              <description>Core buck  zero crossing trim value</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKHYSTTRIM</name>
              <description>Hysterisis trim for core buck</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG1</name>
          <description>Analog LDO Reg 1</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>

          <fields>
            <field>
              <name>CORELDOIBSTRM</name>
              <description>CORE LDO IBIAS Trim</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOLPTRIM</name>
              <description>CORE LDO Low Power Trim</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRIMCORELDOR3</name>
              <description>CORE LDO tempco trim (R3).</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRIMCORELDOR1</name>
              <description>CORE LDO Active mode ouput trim (R1).</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG2</name>
          <description>LDO Control Register 2</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>

          <fields>
            <field>
              <name>CORELDOVDDLEN</name>
              <description>Core LDO output enable.  0=Hi-Z, 1=enable. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAMLDOLPMODE</name>
              <description>RAM LDO LP Mode. 0=normal mode, 1=low power mode;  This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMODE</name>
                  <description>RAM IN LP mode value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDRAMLDO</name>
              <description>RAM LDO Power Down. 0=powered up, 1=powered down ; This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Power down RAM LDO. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDANALDO</name>
              <description>Analog LDO Power Down. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Power down Analog LDO. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDMEMLDO</name>
              <description>MEM LDO Power Down. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Power down Flash LDO. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDCORELDO</name>
              <description>CORE LDO Power Down. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Power down Core LDO. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPANALDO</name>
              <description>Analog LDO Sleep. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Analog LDO sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPMEMLDO</name>
              <description>FLASH LDO Sleep. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>SRAM LDO sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPCORELDO</name>
              <description>CORE LDO Sleep. This value is propagated only when LDO2SWE bit is active(1).</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Core LDO sleep. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFSELANALDO</name>
              <description>CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

