cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>VREFSELSRAMLDO</name>
              <description>CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFSELFLASHLDO</name>
              <description>CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFSELCORELDO</name>
              <description>CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRIMANALDO</name>
              <description>Analog LDO Trim.</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAMLDOTRIM</name>
              <description>RAM LDO TRIM</description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LDO2SWE</name>
              <description>LDO2 Software Override Enable. If enabled (=1), this will enable the override values from this register to be used instead of the normal control signals for the following fields: CORELDOVDDLEN, RAMLDOLPMODE, PWDRAMLDO, PWDANALDO, PWDMEMLDO,  PWDCORELDO, SLEEPANALDO,  SLEEPMEMLDO, SLEEPCORELDO.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>LDO2 Software Override Disable. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>LDO2 Software Override Enable. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG3</name>
          <description>LDO Control Register 3</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>TRIMMEMLDOR1</name>
              <description>MEM LDO active mode trim (R1).</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPALTTRIM</name>
              <description>MEM LDO TRIM for low power mode with ADC active</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPTRIM</name>
              <description>MEM LDO TRIM for low power mode with ADC inactive</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BODPORCTRL</name>
          <description>BOD and PDR control Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>BODEXTREFSEL</name>
              <description>BOD External Reference Select.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT</name>
                  <description>BOD external reference select. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDREXTREFSEL</name>
              <description>PDR External Reference Select.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT</name>
                  <description>PDR external reference select. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDBOD</name>
              <description>BOD Power Down.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>BOD power down. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDPDR</name>
              <description>PDR Power Down.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>PDR power down value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPWRDLY</name>
          <description>ADC Power Up Delay Control</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>ADCPWR1</name>
              <description>ADC Reference Keeper enable delay in 16 ADC CLK increments for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

