cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>ADCPWR0</name>
              <description>ADC Reference Buffer Power Enable delay in 64 ADC CLK increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCCAL</name>
          <description>ADC Calibration Control</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>ADCCALIBRATED</name>
              <description>Status for ADC Calibration</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>ADC is not calibrated value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>ADC is calibrated value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALONPWRUP</name>
              <description>Run ADC Calibration on initial power up sequence</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable automatic calibration on initial power up value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable automatic calibration on initial power up value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBATTLOAD</name>
          <description>ADC Battery Load Enable</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BATTLOAD</name>
              <description>Enable the ADC battery load resistor</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Battery load is disconnected value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Battery load is enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUCKTRIM</name>
          <description>Trim settings for Core and Mem buck modules</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0F3F3F</resetMask>

          <fields>
            <field>
              <name>RSVD2</name>
              <description>RESERVED.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKR1_HI</name>
              <description>Core Buck voltage output trim bits[9:6]. Concatenate with field COREBUCKR1_LO for the full trim value.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBUCKR1_LO</name>
              <description>Core Buck voltage output trim bits[5:0], Concatenate with field COREBUCKR1_HI for the full trim value.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBUCKR1</name>
              <description>Trim values for BUCK regulator.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIM</name>
          <description>ADC Trims</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FC3</resetMask>

          <fields>
            <field>
              <name>ADCRFBUFIBTRIM</name>
              <description>ADC reference buffer input bias trim</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCREFBUFTRIM</name>
              <description>ADC Reference buffer trim</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCREFKEEPIBTRIM</name>
              <description>ADC Reference Ibias trim</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

