cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ADCREFCOMP</name>
          <description>ADC Reference Keeper and Comparator Control</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00011F01</resetMask>

          <fields>
            <field>
              <name>ADCRFCMPEN</name>
              <description>ADC Reference comparator power down</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCREFKEEPTRIM</name>
              <description>ADC Reference Keeper Trim</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_REFCOMP_OUT</name>
              <description>Output of the ADC reference comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>XTALGENCTRL</name>
          <description>XTAL Oscillator General Control</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>

          <fields>
            <field>
              <name>XTALKSBIASTRIM</name>
              <description>XTAL IBIAS Kick start trim . This trim value is used during the startup process to enable a faster lock and is applied when the kickstart signal is active.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALBIASTRIM</name>
              <description>XTAL IBIAS trim</description>
              <bitRange>[7:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACWARMUP</name>
              <description>Auto-calibration delay control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SEC</name>
                  <description>Warmup period of 1-2 seconds value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SEC</name>
                  <description>Warmup period of 2-4 seconds value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>Warmup period of 4-8 seconds value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8SEC</name>
                  <description>Warmup period of 8-16 seconds value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTCLKSEL</name>
          <description>Source selection of LFRC, HFRC and XTAL clock sources</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>EXT_HF</name>
              <description>HFRC External Clock Source Select.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Select the internal HFRC clock source. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Select the external HFRC clock source. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_LF</name>
              <description>LFRC External Clock Source Select.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Select the internal LFRC clock source. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Select the external LFRC clock source. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_XT</name>
              <description>XTAL External Clock Source Select.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Select the internal XT clock source. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>Select the external XT clock source. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOADERLOW</name>
          <description>Determines whether the bootloader code is visible at address 0x00000000</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>VALUE</name>
              <description>Determines whether the bootloader code is visible at address 0x00000000 or not.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR0</name>
                  <description>Bootloader code at 0x00000000. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADOWVALID</name>
          <description>Register to indicate whether the shadow registers have been successfully loaded from the Flash Information Space.</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>BL_DSLEEP</name>
              <description>Indicates whether the bootloader should sleep or deep sleep if no image loaded.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Bootloader will go to deep sleep if no flash image loaded value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Indicates whether the shadow registers contain valid data from the Flash Information Space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash information space contains valid data. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICODEFAULTADDR</name>
          <description>ICODE bus address which was present when a bus fault occurred.</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>The ICODE bus address observed when a Bus Fault occurred. Once an address is captured in this field, it is held until the corresponding Fault Observed bit is cleared in the FAULTSTATUS register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

