cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>PDM</name>
      <version>1.0</version>
      <description>PDM Audio</description>
      <!-- <groupName>GROUP_PDM</groupName> -->
      <baseAddress>0x50011000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDM</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>PCFG</name>
          <description>PDM Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000C365</resetValue>
          <resetMask>0xFF87FFFF</resetMask>

          <fields>
            <field>
              <name>LRSWAP</name>
              <description>Left/right channel swap.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Swap left and right channels (FIFO Read RIGHT_LEFT). value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSWAP</name>
                  <description>No channel swapping (IFO Read LEFT_RIGHT). value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGARIGHT</name>
              <description>Right channel PGA gain.</description>
              <bitRange>[30:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M15DB</name>
                  <description>-1.5 db gain. value.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M300DB</name>
                  <description>-3.0 db gain. value.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M45DB</name>
                  <description>-4.5 db gain. value.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M60DB</name>
                  <description>-6.0 db gain. value.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M75DB</name>
                  <description>-7.5 db gain. value.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M90DB</name>
                  <description>-9.0 db gain. value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M105DB</name>
                  <description>-10.5 db gain. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M120DB</name>
                  <description>-12.0 db gain. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P105DB</name>
                  <description>10.5 db gain. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P90DB</name>
                  <description>9.0 db gain. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P75DB</name>
                  <description>7.5 db gain. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P60DB</name>
                  <description>6.0 db gain. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P45DB</name>
                  <description>4.5 db gain. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30DB</name>
                  <description>3.0 db gain. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15DB</name>
                  <description>1.5 db gain. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>0.0 db gain. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGALEFT</name>
              <description>Left channel PGA gain.</description>
              <bitRange>[26:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M15DB</name>
                  <description>-1.5 db gain. value.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M300DB</name>
                  <description>-3.0 db gain. value.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M45DB</name>
                  <description>-4.5 db gain. value.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M60DB</name>
                  <description>-6.0 db gain. value.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M75DB</name>
                  <description>-7.5 db gain. value.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M90DB</name>
                  <description>-9.0 db gain. value.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M105DB</name>
                  <description>-10.5 db gain. value.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M120DB</name>
                  <description>-12.0 db gain. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P105DB</name>
                  <description>10.5 db gain. value.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P90DB</name>
                  <description>9.0 db gain. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P75DB</name>
                  <description>7.5 db gain. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P60DB</name>
                  <description>6.0 db gain. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P45DB</name>
                  <description>4.5 db gain. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30DB</name>
                  <description>3.0 db gain. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15DB</name>
                  <description>1.5 db gain. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>0.0 db gain. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKDIV</name>
              <description>PDM_CLK frequency divisor.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCKDIV4</name>
                  <description>Divide input clock by 4 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV3</name>
                  <description>Divide input clock by 3 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV2</name>
                  <description>Divide input clock by 2 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV1</name>
                  <description>Divide input clock by 1 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINCRATE</name>
              <description>SINC decimation rate.</description>
              <bitRange>[16:10]</bitRange>
              <access>read-write</access>

