cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>ADCHPD</name>
              <description>High pass filter control.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable high pass filter. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable high pass filter. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPCUTOFF</name>
              <description>High pass filter coefficients.</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CYCLES</name>
              <description>Number of clocks during gain-setting changes.</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SOFTMUTE</name>
              <description>Soft mute control.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Soft Mute. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Soft Mute. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMCORE</name>
              <description>Data Streaming Control.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Data Streaming. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Data Streaming. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VCFG</name>
          <description>Voice Configuration Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFC1B0118</resetMask>

          <fields>
            <field>
              <name>IOCLKEN</name>
              <description>Enable the IO clock.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable FIFO read. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable FIFO read. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset the IP core.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset the core. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORM</name>
                  <description>Enable the core. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMCLKSEL</name>
              <description>Select the PDM input clock.</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Static value. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MHz</name>
                  <description>PDM clock is 12 MHz. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6MHz</name>
                  <description>PDM clock is 6 MHz. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3MHz</name>
                  <description>PDM clock is 3 MHz. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_5MHz</name>
                  <description>PDM clock is 1.5 MHz. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>750KHz</name>
                  <description>PDM clock is 750 KHz. value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>375KHz</name>
                  <description>PDM clock is 375 KHz. value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>187KHz</name>
                  <description>PDM clock is 187.5 KHz. value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMCLK</name>
              <description>Enable the serial clock.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable serial clock. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable serial clock. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2SMODE</name>
              <description>I2S interface enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable I2S interface. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable I2S interface. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCLKINV</name>
              <description>I2S BCLK input inversion.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV</name>
                  <description>BCLK inverted. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORM</name>
                  <description>BCLK not inverted. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMICKDEL</name>
              <description>PDM clock sampling delay.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0CYC</name>
                  <description>No delay. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1CYC</name>
                  <description>1 cycle delay. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELAP</name>
              <description>Select PDM input clock source.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S</name>
                  <description>Clock source from I2S BCLK. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>Clock source from internal clock generator. value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCMPACK</name>
              <description>PCM data packing enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PCM packing. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PCM packing. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSET</name>
              <description>Set PCM channels.</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Channel disabled. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>Mono left channel. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>Mono right channel. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Stereo channels. value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Voice Status Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>FIFOCNT</name>
              <description>Valid 32-bit entries currently in the FIFO.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>

