cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO threshold interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PWRCTRL</name>
      <version>1.0</version>
      <description>PWR Controller Register Bank</description>
      <!-- <groupName>GROUP_PWRCTRL</groupName> -->
      <baseAddress>0x40021000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000024</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>SUPPLYSRC</name>
          <description>Memory and Core Voltage Supply Source Select Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SWITCH_LDO_IN_SLEEP</name>
              <description>Switches the CORE DOMAIN from BUCK mode (if enabled) to LDO when CPU is in DEEP SLEEP. If all the devices are off then this does not matter and LDO (low power mode) is used</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Automatically switch from CORE BUCK to CORE LDO when CPU is in DEEP SLEEP value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COREBUCKEN</name>
              <description>Enables and Selects the Core Buck as the supply for the low-voltage power domain.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Core Buck for the low-voltage power domain. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMBUCKEN</name>
              <description>Enables and select the Memory Buck as the supply for the Flash and SRAM power domain.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Memory Buck as the supply for flash and SRAM. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POWERSTATUS</name>
          <description>Power Status Register for MCU supplies and peripherals</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>COREBUCKON</name>
              <description>Indicates whether the Core low-voltage domain is supplied from the LDO or the Buck.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Indicates the the LDO is supplying the Core low-voltage. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Indicates the the Buck is supplying the Core low-voltage. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMBUCKON</name>
              <description>Indicate whether the Memory power domain is supplied from the LDO or the Buck.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Indicates the LDO is supplying the memory power domain. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Indicates the Buck is supplying the memory power domain. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEEN</name>
          <description>DEVICE ENABLES for SHELBY</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>PDM</name>
              <description>Enable PDM Digital Block</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PDM value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables PDM value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC</name>
              <description>Enable ADC Digital Block</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable ADC value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables ADC value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1</name>
              <description>Enable UART 1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable UART 1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables UART 1 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0</name>
              <description>Enable UART 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable UART 0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables UART 0 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER5</name>
              <description>Enable IO MASTER 5</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 5 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 5 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER4</name>
              <description>Enable IO MASTER 4</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 4 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 4 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER3</name>
              <description>Enable IO MASTER 3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 3 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 3 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER2</name>
              <description>Enable IO MASTER 2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 2 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 2 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER1</name>
              <description>Enable IO MASTER 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 1 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_MASTER0</name>
              <description>Enable IO MASTER 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO MASTER 0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO MASTER 0 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_SLAVE</name>
              <description>Enable IO SLAVE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable IO SLAVE value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables IO SLAVE value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMPWDINSLEEP</name>
          <description>Powerdown an SRAM Banks in Deep Sleep mode</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800007FF</resetMask>

          <fields>
            <field>
              <name>CACHE_PWD_SLP</name>
              <description>Enable CACHE BANKS to power down in deep sleep</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>CACHE BANKS POWER DOWN in CORE SLEEP value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>CACHE BANKS STAYS in Retention in CORE SLEEP value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSLEEPPOWERDOWN</name>
              <description>Selects which SRAM banks are powered down in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks retained value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM0</name>
                  <description>0KB-8KB SRAM value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM1</name>
                  <description>8KB-16KB SRAM value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM2</name>
                  <description>16KB-24KB SRAM value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM3</name>
                  <description>24KB-32KB SRAM value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>32KB-64KB SRAMs value.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>64KB-96KB SRAMs value.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>96KB-128KB SRAMs value.</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>128KB-160KB SRAMs value.</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>160KB-192KB SRAMs value.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>192KB-224KB SRAMs value.</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>224KB-256KB SRAMs value.</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM16K</name>
                  <description>Do not Retain lower 16KB value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM32K</name>
                  <description>Do not Retain lower 32KB value.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM64K</name>
                  <description>Do not Retain lower 64KB value.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>Do not Retain lower 128KB value.</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER8K</name>
                  <description>All banks but lower 8k powered down. value.</description>
                  <value>2046</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER16K</name>
                  <description>All banks but lower 16k powered down. value.</description>
                  <value>2044</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER24K</name>
                  <description>All banks but lower 24k powered down. value.</description>
                  <value>2040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER32K</name>
                  <description>All banks but lower 32k powered down. value.</description>
                  <value>2032</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER64K</name>
                  <description>All banks but lower 64k powered down. value.</description>
                  <value>2016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER128K</name>
                  <description>All banks but lower 128k powered down. value.</description>
                  <value>1920</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All banks powered down. value.</description>
                  <value>2047</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMEN</name>
          <description>Disables individual banks of the MEMORY array</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0001FFF</resetValue>
          <resetMask>0xA0001FFF</resetMask>

