cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
          <fields>
            <field>
              <name>CACHEB2</name>
              <description>Enable CACHE BANK 2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 2 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 2 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEB0</name>
              <description>Enable CACHE BANK 0</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 0 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1</name>
              <description>Enable FLASH1</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable FLASH1 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables FLASH1 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0</name>
              <description>Enable FLASH 0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable FLASH 0 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables FLASH 0 value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>Enables power for selected SRAM banks (else an access to its address space to generate a Hard Fault).</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM0</name>
                  <description>0KB-8KB SRAM value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM1</name>
                  <description>8KB-16KB SRAM value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM2</name>
                  <description>16KB-24KB SRAM value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0_SRAM3</name>
                  <description>24KB-32KB SRAM value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>32KB-64KB SRAMs value.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>64KB-96KB SRAMs value.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>96KB-128KB SRAMs value.</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>128KB-160KB SRAMs value.</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>160KB-192KB SRAMs value.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>192KB-224KB SRAMs value.</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>224KB-256KB SRAMs value.</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM16K</name>
                  <description>ENABLE lower 16KB value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM32K</name>
                  <description>ENABLE lower 32KB value.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM64K</name>
                  <description>ENABLE lower 64KB value.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>ENABLE lower 128KB value.</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM256K</name>
                  <description>ENABLE lower 256KB value.</description>
                  <value>2047</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRONSTATUS</name>
          <description>POWER ON Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x002FFFFE</resetMask>

          <fields>
            <field>
              <name>PD_CACHEB2</name>
              <description>This bit is 1 if power is supplied to CACHE BANK 2</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

