cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>PD_CACHEB0</name>
              <description>This bit is 1 if power is supplied to CACHE BANK 0</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP7_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP7</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP6_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP6</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP5_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP5</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP4_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP4</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP3_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP3</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP2_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP2</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP1_SRAM</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_GRP1</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP0_SRAM3</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_SRAM0_3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP0_SRAM2</name>
              <description>This bit is 1 if power is supplied to SRAM domain PD_SRAM0_2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP0_SRAM1</name>
              <description>This bit is 1 if power is supplied to SRAM domain SRAM0_1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_GRP0_SRAM0</name>
              <description>This bit is 1 if power is supplied to SRAM domain SRAM0_0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PDADC</name>
              <description>This bit is 1 if power is supplied to domain PD_ADC</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_FLAM1</name>
              <description>This bit is 1 if power is supplied to domain PD_FLAM1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_FLAM0</name>
              <description>This bit is 1 if power is supplied to domain PD_FLAM0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PD_PDM</name>
              <description>This bit is 1 if power is supplied to domain PD_PDM</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PDC</name>
              <description>This bit is 1 if power is supplied to power domain C, which supplies IOM3-5.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PDB</name>
              <description>This bit is 1 if power is supplied to power domain B, which supplies IOM0-2.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PDA</name>
              <description>This bit is 1 if power is supplied to power domain A, which supplies IOS and UART0,1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>SRAM Control register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SRAM_MASTER_CLKGATE</name>
              <description>Enables top-level clock gating in the SRAM block.  This bit should be enabled for lowest power operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master SRAM Clock Gate value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Master SRAM Clock Gating value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_CLKGATE</name>
              <description>Enables individual per-RAM clock gating in the SRAM block.  This bit should be enabled for lowest power operation.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Individual SRAM Clock Gating value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Individual SRAM Clock Gating value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_LIGHT_SLEEP</name>
              <description>Enable LS (light sleep) of cache RAMs.  When this bit is set, the RAMS will be put into light sleep mode while inactive.  NOTE:  if the SRAM is actively used, this may have an adverse affect on power since entering/exiting LS mode may consume more power than would be saved.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable LIGHT SLEEP for SRAMs value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables LIGHT SLEEP for SRAMs value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSTATUS</name>
          <description>Power Status Register for ADC Block</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>ADC_REFBUF_PWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

