cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>ADC_REFKEEP_PWD</name>
              <description>This bit indicates that the ADC REFKEEP is powered down</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_VBAT_PWD</name>
              <description>This bit indicates that the ADC VBAT resistor divider is powered down</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_VPTAT_PWD</name>
              <description>This bit indicates that the ADC temperature sensor input buffer is powered down</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_BGT_PWD</name>
              <description>This bit indicates that the ADC Band Gap is powered down</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_PWD</name>
              <description>This bit indicates that the ADC is powered down</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MISCOPT</name>
          <description>Power Optimization Control Bits</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DIS_LDOLPMODE_TIMERS</name>
              <description>Setting this bit will enable the MEM LDO to be in LPMODE during deep sleep even when the ctimers or stimers are running</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIS_LDOLPMODE_HFRC</name>
              <description>Setting this bit will enable the Core LDO to be in LPMODE during deep sleep even when HFRC is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_EN_MASK</name>
              <description>Control Bit to mask the ADC_EN in the adc_pwr_down equation.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>RSTGEN</name>
      <version>1.0</version>
      <description>MCU Reset Generator</description>
      <!-- <groupName>GROUP_RSTGEN</groupName> -->
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>WDREN</name>
              <description>Watchdog Timer Reset Enable.  NOTE: The WDT module must also be configured for WDT reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHREN</name>
              <description>Brown out high (2.1v) reset enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SWPOI</name>
          <description>Software POI Reset</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPOIKEY</name>
              <description>0x1B generates a software POI reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0x1B key value generates a software POI reset. value.</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPOR</name>
          <description>Software POR Reset</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPORKEY</name>
              <description>0xD4 generates a software POR reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0xD4 key value generates a software POR reset. value.</description>
                  <value>212</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>WDRSTAT</name>
              <description>Reset was initiated by a Watchdog Timer Reset.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

