cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>DBGRSTAT</name>
              <description>Reset was a initiated by Debugger Reset.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POIRSTAT</name>
              <description>Reset was a initiated by Software POI Reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SWRSTAT</name>
              <description>Reset was a initiated by SW POR or AIRCR Reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BORSTAT</name>
              <description>Reset was initiated by a Brown-Out Reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PORSTAT</name>
              <description>Reset was initiated by a Power-On Reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXRSTAT</name>
              <description>Reset was initiated by an External Reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLRSTAT</name>
          <description>Clear the status register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CLRSTAT</name>
              <description>Writing a 1 to this bit clears all bits in the RST_STAT.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TPIU_RST</name>
          <description>TPIU reset</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>TPIURST</name>
              <description>Static reset for the TPIU. Write to '1' to assert reset to TPIU. Write to '0' to clear the reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Reset Interrupt register: Enable</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Reset Interrupt register: Status</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Reset Interrupt register: Clear</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Reset Interrupt register: Set</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>UART0</name>
      <version>1.0</version>
      <description>Serial UART</description>
      <!-- <groupName>GROUP_UART</groupName> -->
      <baseAddress>0x4001C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000048</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <name>DR</name>
          <description>UART Data Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>OEDATA</name>
              <description>This is the overrun error indicator.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART OEDATA, overrun error indicator. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART OEDATA, overrun error indicator. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEDATA</name>
              <description>This is the break error indicator.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART BEDATA, break error indicator. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART BEDATA, break error indicator. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEDATA</name>
              <description>This is the parity error indicator.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART PEDATA, parity error indicator. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART PEDATA, parity error indicator. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEDATA</name>
              <description>This is the framing error indicator.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART FEDATA, framing error indicator. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART FEDATA, framing error indicator. value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA</name>
              <description>This is the UART data port.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

