cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IBRD</name>
          <description>Integer Baud Rate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DIVINT</name>
              <description>These bits hold the baud integer divisor.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FBRD</name>
          <description>Fractional Baud Rate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>DIVFRAC</name>
              <description>These bits hold the baud fractional divisor.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LCRH</name>
          <description>Line Control High</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SPS</name>
              <description>This bit holds the stick parity select.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WLEN</name>
              <description>These bits hold the write length.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEN</name>
              <description>This bit holds the FIFO enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STP2</name>
              <description>This bit holds the two stop bits select.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EPS</name>
              <description>This bit holds the even parity select.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEN</name>
              <description>This bit holds the parity enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BRK</name>
              <description>This bit holds the break set.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000300</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTSEN</name>
              <description>This bit enables CTS hardware flow control.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTSEN</name>
              <description>This bit enables RTS hardware flow control.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT2</name>
              <description>This bit holds modem Out2.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT1</name>
              <description>This bit holds modem Out1.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTS</name>
              <description>This bit enables request to send.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTR</name>
              <description>This bit enables data transmit ready.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXE</name>
              <description>This bit is the receive enable.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXE</name>
              <description>This bit is the transmit enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LBE</name>
              <description>This bit is the loopback enable.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKSEL</name>
              <description>This bitfield is the UART clock select.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLK</name>
                  <description>No UART clock.  This is the low power default. value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24MHZ</name>
                  <description>24 MHz clock. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MHZ</name>
                  <description>12 MHz clock. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6MHZ</name>
                  <description>6 MHz clock. value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3MHZ</name>
                  <description>3 MHz clock. value.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>This bit is the UART clock enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

