cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>OMODE</name>
              <description>Current RTC oscillator (1 => LFRC, 0 => XT)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HFADJ</name>
          <description>HFRC Adjustment</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0025B800</resetValue>
          <resetMask>0x00FFFF0F</resetMask>

          <fields>
            <field>
              <name>HFADJ_GAIN</name>
              <description>Gain control for HFRC adjustment</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Gain_of_1</name>
                  <description>HF Adjust with Gain of 1 value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_2</name>
                  <description>HF Adjust with Gain of 0.5 value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_4</name>
                  <description>HF Adjust with Gain of 0.25 value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_8</name>
                  <description>HF Adjust with Gain of 0.125 value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_16</name>
                  <description>HF Adjust with Gain of 0.0625 value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_32</name>
                  <description>HF Adjust with Gain of 0.03125 value.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFWARMUP</name>
              <description>XT warmup period for HFRC adjustment</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SEC</name>
                  <description>Autoadjust XT warmup period = 1-2 seconds value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SEC</name>
                  <description>Autoadjust XT warmup period = 2-4 seconds value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTADJ</name>
              <description>Target HFRC adjustment value.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFADJCK</name>
              <description>Repeat period for HFRC adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>Autoadjust repeat period = 4 seconds value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16SEC</name>
                  <description>Autoadjust repeat period = 16 seconds value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SEC</name>
                  <description>Autoadjust repeat period = 32 seconds value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64SEC</name>
                  <description>Autoadjust repeat period = 64 seconds value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128SEC</name>
                  <description>Autoadjust repeat period = 128 seconds value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SEC</name>
                  <description>Autoadjust repeat period = 256 seconds value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512SEC</name>
                  <description>Autoadjust repeat period = 512 seconds value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024SEC</name>
                  <description>Autoadjust repeat period = 1024 seconds value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFADJEN</name>
              <description>HFRC adjustment control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the HFRC adjustment value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the HFRC adjustment value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFVAL</name>
          <description>HFADJ readback</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>HFTUNERB</name>
              <description>Current HFTUNE value</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

