cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN</name>
              <description>Clock enable status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CLKEN</name>
                  <description>Clock enable for the ADC. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER_CLKEN</name>
                  <description>Clock enable for the CTIMER. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0A_CLKEN</name>
                  <description>Clock enable for the CTIMER0A. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0B_CLKEN</name>
                  <description>Clock enable for the CTIMER0B. value.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1A_CLKEN</name>
                  <description>Clock enable for the CTIMER1A. value.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1B_CLKEN</name>
                  <description>Clock enable for the CTIMER1B. value.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2A_CLKEN</name>
                  <description>Clock enable for the CTIMER2A. value.</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2B_CLKEN</name>
                  <description>Clock enable for the CTIMER2B. value.</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3A_CLKEN</name>
                  <description>Clock enable for the CTIMER3A. value.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3B_CLKEN</name>
                  <description>Clock enable for the CTIMER3B. value.</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR0_CLKEN</name>
                  <description>Clock enable for the IO Master 0. value.</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR1_CLKEN</name>
                  <description>Clock enable for the IO Master 1. value.</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR2_CLKEN</name>
                  <description>Clock enable for the IO Master 2. value.</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR3_CLKEN</name>
                  <description>Clock enable for the IO Master 3. value.</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR4_CLKEN</name>
                  <description>Clock enable for the IO Master 4. value.</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTR5_CLKEN</name>
                  <description>Clock enable for the IO Master 5. value.</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC0_CLKEN</name>
                  <description>Clock enable for the IO Master IFC0. value.</description>
                  <value>65536</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC1_CLKEN</name>
                  <description>Clock enable for the IO Master IFC1. value.</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC2_CLKEN</name>
                  <description>Clock enable for the IO Master IFC2. value.</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC3_CLKEN</name>
                  <description>Clock enable for the IO Master IFC3. value.</description>
                  <value>524288</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC4_CLKEN</name>
                  <description>Clock enable for the IO Master IFC4. value.</description>
                  <value>1048576</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC5_CLKEN</name>
                  <description>Clock enable for the IO Master IFC5. value.</description>
                  <value>2097152</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOSLAVE_CLKEN</name>
                  <description>Clock enable for the IO Slave. value.</description>
                  <value>4194304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM_CLKEN</name>
                  <description>Clock enable for the PDM. value.</description>
                  <value>8388608</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMIFC_CLKEN</name>
                  <description>Clock enable for the PDM IFC. value.</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGEN_CLKEN</name>
                  <description>Clock enable for the RSTGEN. value.</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM_WIPE_CLKEN</name>
                  <description>Clock enable for the SRAM_WIPE. value.</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER_CLKEN</name>
                  <description>Clock enable for the STIMER. value.</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER_CNT_CLKEN</name>
                  <description>Clock enable for the STIMER_CNT. value.</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPIU_CLKEN</name>
                  <description>Clock enable for the TPIU. value.</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_HCLK_CLKEN</name>
                  <description>Clock enable for the UART0_HCLK. value.</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0HF_CLKEN</name>
                  <description>Clock enable for the UART0HF. value.</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN2</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN2</name>
              <description>Clock enable status 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_HCLK_CLKEN</name>
                  <description>Clock enable for the UART1_HCLK. value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1HF_CLKEN</name>
                  <description>Clock enable for the UART1HF. value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_CLKEN</name>
                  <description>Clock enable for the WDT. value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_32KHz_EN</name>
                  <description>Clock enable for the XT_32KHz. value.</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCHFRC</name>
                  <description>Force HFRC On Status. value.</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN3</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN3</name>
              <description>Clock enable status 3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>periph_all_xtal_en</name>
                  <description>At least 1 peripherial is requesting for XTAL Clock value.</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>periph_all_hfrc_en</name>
                  <description>At least 1 peripherial is requesting for HFRC Clock value.</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFADJEN</name>
                  <description>HFRC Adjust Enable Status value.</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_en_out</name>
                  <description>HFRC is enabled during adjustment status value.</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_SOURCE</name>
                  <description>Selects the RTC oscillator (0 => LFRC, 1 => XT) value.</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_EN</name>
                  <description>XT is enabled Status value.</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_EN</name>
                  <description>HFRC is enabled Status value.</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHCLK_EN</name>
                  <description>Flash Clock is enabled Status value.</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTEN</name>
          <description>UART Enable</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000303</resetMask>

          <fields>
            <field>
              <name>UART1EN</name>
              <description>UART1 system clock control</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the UART1 system clock value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the UART1 system clock value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDUCE_FREQ</name>
                  <description>Run UART_Hclk at the same frequency as UART_hfclk value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_POWER_SAV</name>
                  <description>Enable UART_hclk to reduce to UART_hfclk at low power mode value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0EN</name>
              <description>UART0 system clock control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the UART0 system clock value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the UART0 system clock value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDUCE_FREQ</name>
                  <description>Run UART_Hclk at the same frequency as UART_hfclk value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_POWER_SAV</name>
                  <description>Enable UART_hclk to reduce to UART_hfclk at low power mode value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLOW</name>
          <description>RTC Counters Lower</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <resetMask>0x3F7F7FFF</resetMask>

          <fields>
            <field>
              <name>CTRHR</name>
              <description>Hours Counter</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

