cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>CTRMIN</name>
              <description>Minutes Counter</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRSEC</name>
              <description>Seconds Counter</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTR100</name>
              <description>100ths of a second Counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRUP</name>
          <description>RTC Counters Upper</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFF1F3F</resetMask>

          <fields>
            <field>
              <name>CTERR</name>
              <description>Counter read error status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No read error occurred value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDERR</name>
                  <description>Read error occurred value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEB</name>
              <description>Century enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the Century bit from changing value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Century bit to change value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CB</name>
              <description>Century</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2000</name>
                  <description>Century is 2000s value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1900_2100</name>
                  <description>Century is 1900s/2100s value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRWKDY</name>
              <description>Weekdays Counter</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRYR</name>
              <description>Years Counter</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRMO</name>
              <description>Months Counter</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRDATE</name>
              <description>Date Counter</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALMLOW</name>
          <description>RTC Alarms Lower</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F7F7FFF</resetMask>

          <fields>
            <field>
              <name>ALMHR</name>
              <description>Hours Alarm</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALMMIN</name>
              <description>Minutes Alarm</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALMSEC</name>
              <description>Seconds Alarm</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALM100</name>
              <description>100ths of a second Alarm</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALMUP</name>
          <description>RTC Alarms Upper</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00071F3F</resetMask>

          <fields>
            <field>
              <name>ALMWKDY</name>
              <description>Weekdays Alarm</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

