cmsis-svd/cmsis-svd/data/AmbiqMicro/apollo2.svd
            </field>
            <field>
              <name>ALMMO</name>
              <description>Months Alarm</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALMDATE</name>
              <description>Date Alarm</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTL</name>
          <description>RTC Control Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>HR1224</name>
              <description>Hours Counter mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24HR</name>
                  <description>Hours in 24 hour mode value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12HR</name>
                  <description>Hours in 12 hour mode value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTOP</name>
              <description>RTC input clock control</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow the RTC input clock to run value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the RTC input clock value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPT</name>
              <description>Alarm repeat interval</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Alarm interrupt disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Interrupt every year value.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTH</name>
                  <description>Interrupt every month value.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEEK</name>
                  <description>Interrupt every week value.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAY</name>
                  <description>Interrupt every day value.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HR</name>
                  <description>Interrupt every hour value.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Interrupt every minute value.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Interrupt every second/10th/100th value.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRTC</name>
              <description>Counter write control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter writes are disabled value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter writes are enabled value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>CLKGEN Interrupt Register: Enable</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

